src/cf/Catalogs/Задачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Задачи</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Решена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеЗадачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПроекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Блокеры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Задача</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Задачи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/КэшированныеРеквизитыРодителейЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КэшированныеРеквизитыРодителейЗадач</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Решена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПроекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Задачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/Задачи/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Перем Запрос;
	СтандартнаяОбработка = Ложь;
	
	//+++ Проверить, нафига МВТ и нельзя ли без него.
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Параметры.Вставить("Ссылка", Данные.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Задачи.Наименование КАК Наименование,
	|	ВЫБОР
	|		КОГДА Задачи.КодПроекта = """"
	|			ТОГДА ЕСТЬNULL(КэшированныеРеквизитыРодителейЗадач.КодПроекта, """")
	|		ИНАЧЕ Задачи.КодПроекта
	|	КОНЕЦ КАК КодПроекта
	|ИЗ
	|	Справочник.Задачи КАК Задачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КэшированныеРеквизитыРодителейЗадач КАК КэшированныеРеквизитыРодителейЗадач
	|		ПО (КэшированныеРеквизитыРодителейЗадач.Задача = Задачи.Ссылка)
	|ГДЕ
	|	Задачи.Ссылка = &Ссылка"
	;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Представление = 
		  СтрШаблон(
		    "%1%2", 
		    ?(Выборка.КодПроекта = "", "", стрШаблон("[%1] ", Выборка.КодПроекта)),
		    Данные.Наименование
		);
	Иначе
		СтандартнаяОбработка = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПолученияПредставленияОЛД(Данные, Представление, СтандартнаяОбработка)
	Перем Запрос;
	СтандартнаяОбработка = Ложь;
	
	// Да, жесть, но я же извращенец
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Параметры.Вставить("Ссылка", Данные.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Задачи.Родитель КАК НачалоДуги,
	|	Задачи.Ссылка КАК КонецДуги
	|ПОМЕСТИТЬ ЗамыканияДлины1
	|ИЗ
	|	Справочник.Задачи КАК Задачи
	|ГДЕ
	|	Задачи.Родитель <> ЗНАЧЕНИЕ(Справочник.Задачи.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Задачи.Ссылка,
	|	Задачи.Ссылка
	|ИЗ
	|	Справочник.Задачи КАК Задачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПерваяДуга.НачалоДуги КАК НачалоДуги,
	|	ВтораяДуга.КонецДуги КАК КонецДуги
	|ПОМЕСТИТЬ ЗамыканияДлины2
	|ИЗ
	|	ЗамыканияДлины1 КАК ПерваяДуга
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗамыканияДлины1 КАК ВтораяДуга
	|		ПО ПерваяДуга.КонецДуги = ВтораяДуга.НачалоДуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПерваяДуга.НачалоДуги КАК НачалоДуги,
	|	ВтораяДуга.КонецДуги КАК КонецДуги
	|ПОМЕСТИТЬ ЗамыканияДлины4
	|ИЗ
	|	ЗамыканияДлины2 КАК ПерваяДуга
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗамыканияДлины2 КАК ВтораяДуга
	|		ПО ПерваяДуга.КонецДуги = ВтораяДуга.НачалоДуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПерваяДуга.НачалоДуги КАК НачалоДуги,
	|	ВтораяДуга.КонецДуги КАК КонецДуги
	|ПОМЕСТИТЬ ЗамыканияДлины8
	|ИЗ
	|	ЗамыканияДлины4 КАК ПерваяДуга
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗамыканияДлины4 КАК ВтораяДуга
	|		ПО ПерваяДуга.КонецДуги = ВтораяДуга.НачалоДуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПерваяДуга.НачалоДуги КАК НачалоДуги,
	|	ВтораяДуга.КонецДуги КАК КонецДуги
	|ПОМЕСТИТЬ ЗамыканияДлины16
	|ИЗ
	|	ЗамыканияДлины8 КАК ПерваяДуга
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗамыканияДлины8 КАК ВтораяДуга
	|		ПО ПерваяДуга.КонецДуги = ВтораяДуга.НачалоДуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПерваяДуга.НачалоДуги КАК НачалоДуги,
	|	ВтораяДуга.КонецДуги КАК КонецДуги
	|ПОМЕСТИТЬ ЗамыканияДлины32
	|ИЗ
	|	ЗамыканияДлины16 КАК ПерваяДуга
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗамыканияДлины16 КАК ВтораяДуга
	|		ПО ПерваяДуга.КонецДуги = ВтораяДуга.НачалоДуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Замыкания.КонецДуги КАК КонецДуги,
	|	КОЛИЧЕСТВО(Замыкания.НачалоДуги) КАК Уровень,
	|	Замыкания.КонецДуги.КодПроекта КАК КодПроекта
	|ПОМЕСТИТЬ втБлижайшийКодПроекта
	|ИЗ
	|	ЗамыканияДлины32 КАК Замыкания
	|ГДЕ
	|	Замыкания.КонецДуги.КодПроекта <> """"
	|
	|СГРУППИРОВАТЬ ПО
	|	Замыкания.КонецДуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗамыканияДлины32.КонецДуги КАК КонецДуги,
	|	втБлижайшийКодПроекта.Уровень КАК Уровень,
	|	втБлижайшийКодПроекта.КодПроекта КАК КодПроекта
	|ИЗ
	|	ЗамыканияДлины32 КАК ЗамыканияДлины32
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втБлижайшийКодПроекта КАК втБлижайшийКодПроекта
	|		ПО ЗамыканияДлины32.НачалоДуги = втБлижайшийКодПроекта.КонецДуги
	|ГДЕ
	|	ЗамыканияДлины32.КонецДуги = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Уровень УБЫВ"
	;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Представление = 
		  СтрШаблон(
		    "%1%2", 
			?(Выборка.КодПроекта = "", "", стрШаблон("[%1] ", Выборка.КодПроекта)),
		    Данные.Наименование
		  );
	  Иначе
		  СтандартнаяОбработка = Истина;
	  КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	Параметры.Отбор.Вставить("Решена", Ложь);
	Параметры.Отбор.Вставить("ПометкаУдаления", Ложь);
КонецПроцедуры
